src/cf/Documents/НачислениеСписаниеБонусныхБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеСписаниеБонусныхБаллов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеБаллы</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияБонусныхБаллов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленияБонусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонуснаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаНачисленияБонусов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АналитикаНачисленияБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСгорания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписанияБонусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонуснаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаКСписанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/НачислениеСписаниеБонусныхБаллов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значение, содержащую данные для проведения по регистру.
// Таблицу значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеБаллы(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = РаботаСБонусами.СформироватьТекстЗапросаПоБонуснымБаллам();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаБонусныеБаллы = РезультатЗапроса[0].Выгрузить();
	ТаблицаОплатаБонусами = РезультатЗапроса[1].Выгрузить();
	
	Для Каждого СтрокаОплаты Из ТаблицаОплатаБонусами Цикл
		НоваяСтрока = ТаблицаБонусныеБаллы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеБаллы", ТаблицаБонусныеБаллы);
	
КонецПроцедуры

Процедура СформироватьТаблицаНачисленияБонусныхБаллов(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаОтчетОРозничныхПродажах.НачисленияБонусов.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияБонусныхБаллов", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = РаботаСБонусами.СформироватьТекстЗапросаПоНачислениямБонусныхБаллов();
	ТаблицаНачисленияБонусныхБаллов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияБонусныхБаллов", ТаблицаНачисленияБонусныхБаллов);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.НомерСтроки КАК НомерСтроки,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка.Дата КАК Период,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.БонуснаяКарта КАК БонуснаяКарта,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.АналитикаНачисленияБонусов КАК АналитикаНачисленияБонусов,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Количество КАК Количество,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.ДатаНачисления КАК ДатаНачисления,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.ДатаСгорания КАК ДатаСгорания,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияБонусов
	|ИЗ
	|	Документ.НачислениеСписаниеБонусныхБаллов.НачисленияБонусов КАК НачислениеСписаниеБонусныхБалловНачисленияБонусов
	|ГДЕ
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.НомерСтроки КАК НомерСтроки,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка.Дата КАК Период,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.БонуснаяКарта КАК БонуснаяКарта,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Количество КАК Количество,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.КорректировкаКСписанию КАК КСписанию,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблицаСписанияБонусов
	|ИЗ
	|	Документ.НачислениеСписаниеБонусныхБаллов.СписанияБонусов КАК НачислениеСписаниеБонусныхБалловСписанияБонусов
	|ГДЕ
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеСписаниеБонусныхБаллов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаБонусныеБаллы(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНачисленияБонусныхБаллов(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#КонецЕсли
